In [45]:
import pandas as pd

In [46]:
standings_df = pd.read_html('https://fbref.com/en/comps/9/2024-2025/2024-2025-Premier-League-Stats',
						   attrs={'id': 'results2024-202591_overall'})[0]
squad_stats_df_2024 = pd.read_html('https://fbref.com/en/comps/9/2024-2025/2024-2025-Premier-League-Stats',
									attrs={'id': 'stats_squads_standard_for'})[0]
squad_stats_df_2025 = pd.read_html('https://fbref.com/en/comps/9/Premier-League-Stats',
                                   attrs={'id': 'stats_squads_standard_for'})[0]

In [47]:
selected_columns = ["Rk", "Squad", "Pts","W","D","L", "GD", "GF", "GA","xG"]  # Replace with your desired column names
filtered_df = standings_df[selected_columns]
filtered_df.head()

   Rk            Squad  Pts   W   D   L  GD  GF  GA    xG
0   1        Liverpool   84  25   9   4  45  86  41  82.2
1   2          Arsenal   74  20  14   4  35  69  34  59.9
2   3  Manchester City   71  21   8   9  28  72  44  68.1
3   4          Chelsea   69  20   9   9  21  64  43  67.8
4   5    Newcastle Utd   66  20   6  12  21  68  47  63.8

In [48]:
filtered_df = filtered_df.sort_values(by='Squad')
filtered_df.head()

   Rk        Squad  Pts   W   D   L  GD  GF  GA    xG
1   2      Arsenal   74  20  14   4  35  69  34  59.9
5   6  Aston Villa   66  19   9  10   7  58  51  56.1
8   9  Bournemouth   56  15  11  12  12  58  46  64.0
9  10    Brentford   56  16   8  14   9  66  57  59.0
7   8     Brighton   61  16  13   9   7  66  59  58.7

In [49]:
picked_columns = [
	('Unnamed: 0_level_0', 'Squad'),
	('Unnamed: 1_level_0', '# Pl'),
	('Unnamed: 2_level_0', 'Age'),
	('Unnamed: 3_level_0', 'Poss')
]
filtered_stats1_df = squad_stats_df_2024[picked_columns]

In [50]:
filtered_stats1_df.columns = filtered_stats1_df.columns.droplevel(0)
filtered_stats1_df.head()

         Squad  # Pl   Age  Poss
0      Arsenal    25  25.8  56.9
1  Aston Villa    28  27.0  50.5
2  Bournemouth    29  25.1  48.5
3    Brentford    28  25.8  47.9
4     Brighton    32  24.8  52.3

In [51]:
filtered_stats2_df = squad_stats_df_2025[picked_columns]
filtered_stats2_df.columns = filtered_stats2_df.columns.droplevel(0)
filtered_stats2_df.head()

         Squad  # Pl   Age  Poss
0      Arsenal    21  25.7  51.0
1  Aston Villa    19  28.5  58.7
2  Bournemouth    18  26.4  45.7
3    Brentford    18  24.8  38.7
4     Brighton    19  25.9  48.0

In [52]:
merged_df = pd.merge(filtered_df, filtered_stats1_df, on='Squad', how='left')
merged_df = pd.merge(merged_df, filtered_stats2_df, on='Squad', how='left', suffixes=('_2024', '_2025'))

In [53]:
merged_df.shape

(20, 16)

In [54]:
merged_df.head()

,Rk,Squad,Pts,W,D,L,GD,GF,GA,xG,# Pl_2024,Age_2024,Poss_2024,# Pl_2025,Age_2025,Poss_2025
0,2,Arsenal,74,20,14,4,35,69,34,59.9,25,25.8,56.9,21.0,25.7,51.0
1,6,Aston Villa,66,19,9,10,7,58,51,56.1,28,27.0,50.5,19.0,28.5,58.7
2,9,Bournemouth,56,15,11,12,12,58,46,64.0,29,25.1,48.5,18.0,26.4,45.7
3,10,Brentford,56,16,8,14,9,66,57,59.0,28,25.8,47.9,18.0,24.8,38.7
4,8,Brighton,61,16,13,9,7,66,59,58.7,32,24.8,52.3,19.0,25.9,48.0

In [55]:
merged_df = merged_df.sort_values(by='Rk').reset_index(drop=True)
merged_df.head()

,Rk,Squad,Pts,W,D,L,GD,GF,GA,xG,# Pl_2024,Age_2024,Poss_2024,# Pl_2025,Age_2025,Poss_2025
0,1,Liverpool,84,25,9,4,45,86,41,82.2,24,27.2,57.7,20.0,27.1,58.7
1,2,Arsenal,74,20,14,4,35,69,34,59.9,25,25.8,56.9,21.0,25.7,51.0
2,3,Manchester City,71,21,8,9,28,72,44,68.1,30,26.8,61.3,19.0,25.7,60.7
3,4,Chelsea,69,20,9,9,21,64,43,67.8,29,23.7,57.1,19.0,24.4,61.0
4,5,Newcastle Utd,66,20,6,12,21,68,47,63.8,24,27.4,51.3,18.0,28.3,51.3

In [56]:
import os
os.makedirs('data', exist_ok=True)
merged_df.to_csv('data/premier_league_standings_filtered.csv', index=False)